AShort10/Parte1/generateLogs095417/k6-fcxt8_tracing_20230201_094318.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /load-testing.js
     output: -

  scenarios: (100.00%) 1 scenario, 2 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 2 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 2 VUs  0m01.0s/2m0s
time="2023-02-01T12:43:18Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"
time="2023-02-01T12:43:18Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"

running (0m02.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 2 VUs  0m02.0s/2m0s
time="2023-02-01T12:43:19Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"
time="2023-02-01T12:43:19Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"
time="2023-02-01T12:43:19Z" level=warning msg="Timer exhausted! The execution time of the test took longer than 2 seconds" source=console
time="2023-02-01T12:43:19Z" level=warning msg="Timer exhausted! The execution time of the test took longer than 2 seconds" source=console

running (0m03.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 2 VUs  0m03.0s/2m0s
time="2023-02-01T12:43:20Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"

running (0m04.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 2 VUs  0m04.0s/2m0s
time="2023-02-01T12:43:21Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"
time="2023-02-01T12:43:21Z" level=warning msg="Timer exhausted! The execution time of the test took longer than 2 seconds" source=console

running (0m05.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 2 VUs  0m05.0s/2m0s
time="2023-02-01T12:43:22Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"

running (0m06.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
default   [   5% ] 2 VUs  0m06.0s/2m0s
time="2023-02-01T12:43:23Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"
time="2023-02-01T12:43:23Z" level=warning msg="Timer exhausted! The execution time of the test took longer than 2 seconds" source=console

running (0m07.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 2 VUs  0m07.0s/2m0s
time="2023-02-01T12:43:24Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"

running (0m08.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [   7% ] 2 VUs  0m08.0s/2m0s
time="2023-02-01T12:43:25Z" level=warning msg="Request Failed" error="Get \"http://nginx-ingress.default.svc/news.php\": dial tcp 10.98.140.207:80: connect: connection refused"
time="2023-02-01T12:43:25Z" level=warning msg="Timer exhausted! The execution time of the test took longer than 2 seconds" source=console

running (0m09.0s), 2/2 VUs, 5 complete and 0 interrupted iterations
default   [   7% ] 2 VUs  0m09.0s/2m0s

running (0m10.0s), 2/2 VUs, 5 complete and 0 interrupted iterations
default   [   8% ] 2 VUs  0m10.0s/2m0s

running (0m11.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [   9% ] 2 VUs  0m11.0s/2m0s
time="2023-02-01T12:43:28Z" level=warning msg="Timer exhausted! The execution time of the test took longer than 2 seconds" source=console

running (0m12.0s), 2/2 VUs, 7 complete and 0 interrupted iterations
default   [  10% ] 2 VUs  0m12.0s/2m0s

running (0m13.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  11% ] 2 VUs  0m13.0s/2m0s

running (0m14.0s), 2/2 VUs, 9 complete and 0 interrupted iterations
default   [  12% ] 2 VUs  0m14.0s/2m0s

running (0m15.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  12% ] 2 VUs  0m15.0s/2m0s

running (0m16.0s), 2/2 VUs, 11 complete and 0 interrupted iterations
default   [  13% ] 2 VUs  0m16.0s/2m0s

running (0m17.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  14% ] 2 VUs  0m17.0s/2m0s

running (0m18.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  15% ] 2 VUs  0m18.0s/2m0s

running (0m19.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  16% ] 2 VUs  0m19.0s/2m0s

running (0m20.0s), 2/2 VUs, 15 complete and 0 interrupted iterations
default   [  17% ] 2 VUs  0m20.0s/2m0s

running (0m21.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  17% ] 2 VUs  0m21.0s/2m0s

running (0m22.0s), 2/2 VUs, 17 complete and 0 interrupted iterations
default   [  18% ] 2 VUs  0m22.0s/2m0s

running (0m23.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  19% ] 2 VUs  0m23.0s/2m0s

running (0m24.0s), 2/2 VUs, 19 complete and 0 interrupted iterations
default   [  20% ] 2 VUs  0m24.0s/2m0s

running (0m25.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  21% ] 2 VUs  0m25.0s/2m0s

running (0m26.0s), 2/2 VUs, 21 complete and 0 interrupted iterations
default   [  22% ] 2 VUs  0m26.0s/2m0s

running (0m27.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  22% ] 2 VUs  0m27.0s/2m0s

running (0m28.0s), 2/2 VUs, 23 complete and 0 interrupted iterations
default   [  23% ] 2 VUs  0m28.0s/2m0s

running (0m29.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  24% ] 2 VUs  0m29.0s/2m0s

running (0m30.0s), 2/2 VUs, 25 complete and 0 interrupted iterations
default   [  25% ] 2 VUs  0m30.0s/2m0s

running (0m31.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  26% ] 2 VUs  0m31.0s/2m0s

running (0m32.0s), 2/2 VUs, 27 complete and 0 interrupted iterations
default   [  27% ] 2 VUs  0m32.0s/2m0s

running (0m33.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [  27% ] 2 VUs  0m33.0s/2m0s

running (0m34.0s), 2/2 VUs, 29 complete and 0 interrupted iterations
default   [  28% ] 2 VUs  0m34.0s/2m0s

running (0m35.0s), 2/2 VUs, 30 complete and 0 interrupted iterations
default   [  29% ] 2 VUs  0m35.0s/2m0s

running (0m36.0s), 2/2 VUs, 31 complete and 0 interrupted iterations
default   [  30% ] 2 VUs  0m36.0s/2m0s

running (0m37.0s), 2/2 VUs, 32 complete and 0 interrupted iterations
default   [  31% ] 2 VUs  0m37.0s/2m0s

running (0m38.0s), 2/2 VUs, 33 complete and 0 interrupted iterations
default   [  32% ] 2 VUs  0m38.0s/2m0s

running (0m39.0s), 2/2 VUs, 34 complete and 0 interrupted iterations
default   [  32% ] 2 VUs  0m39.0s/2m0s

running (0m40.0s), 2/2 VUs, 35 complete and 0 interrupted iterations
default   [  33% ] 2 VUs  0m40.0s/2m0s

running (0m41.0s), 2/2 VUs, 36 complete and 0 interrupted iterations
default   [  34% ] 2 VUs  0m41.0s/2m0s

running (0m42.0s), 2/2 VUs, 37 complete and 0 interrupted iterations
default   [  35% ] 2 VUs  0m42.0s/2m0s

running (0m43.0s), 2/2 VUs, 38 complete and 0 interrupted iterations
default   [  36% ] 2 VUs  0m43.0s/2m0s

running (0m44.0s), 2/2 VUs, 39 complete and 0 interrupted iterations
default   [  37% ] 2 VUs  0m44.0s/2m0s

running (0m45.0s), 2/2 VUs, 40 complete and 0 interrupted iterations
default   [  37% ] 2 VUs  0m45.0s/2m0s

running (0m46.0s), 2/2 VUs, 41 complete and 0 interrupted iterations
default   [  38% ] 2 VUs  0m46.0s/2m0s

running (0m47.0s), 2/2 VUs, 42 complete and 0 interrupted iterations
default   [  39% ] 2 VUs  0m47.0s/2m0s

running (0m48.0s), 2/2 VUs, 43 complete and 0 interrupted iterations
default   [  40% ] 2 VUs  0m48.0s/2m0s

running (0m49.0s), 2/2 VUs, 44 complete and 0 interrupted iterations
default   [  41% ] 2 VUs  0m49.0s/2m0s

running (0m50.0s), 2/2 VUs, 45 complete and 0 interrupted iterations
default   [  42% ] 2 VUs  0m50.0s/2m0s

running (0m51.0s), 2/2 VUs, 46 complete and 0 interrupted iterations
default   [  42% ] 2 VUs  0m51.0s/2m0s

running (0m52.0s), 2/2 VUs, 47 complete and 0 interrupted iterations
default   [  43% ] 2 VUs  0m52.0s/2m0s

running (0m53.0s), 2/2 VUs, 48 complete and 0 interrupted iterations
default   [  44% ] 2 VUs  0m53.0s/2m0s

running (0m54.0s), 2/2 VUs, 49 complete and 0 interrupted iterations
default   [  45% ] 2 VUs  0m54.0s/2m0s

running (0m55.0s), 2/2 VUs, 50 complete and 0 interrupted iterations
default   [  46% ] 2 VUs  0m55.0s/2m0s

running (0m56.0s), 2/2 VUs, 51 complete and 0 interrupted iterations
default   [  47% ] 2 VUs  0m56.0s/2m0s

running (0m57.0s), 2/2 VUs, 52 complete and 0 interrupted iterations
default   [  47% ] 2 VUs  0m57.0s/2m0s

running (0m58.0s), 2/2 VUs, 53 complete and 0 interrupted iterations
default   [  48% ] 2 VUs  0m58.0s/2m0s

running (0m59.0s), 2/2 VUs, 54 complete and 0 interrupted iterations
default   [  49% ] 2 VUs  0m59.0s/2m0s

running (1m00.0s), 2/2 VUs, 55 complete and 0 interrupted iterations
default   [  50% ] 2 VUs  1m00.0s/2m0s

running (1m01.0s), 2/2 VUs, 56 complete and 0 interrupted iterations
default   [  51% ] 2 VUs  1m01.0s/2m0s

running (1m02.0s), 2/2 VUs, 57 complete and 0 interrupted iterations
default   [  52% ] 2 VUs  1m02.0s/2m0s

running (1m03.0s), 2/2 VUs, 58 complete and 0 interrupted iterations
default   [  52% ] 2 VUs  1m03.0s/2m0s

running (1m04.0s), 2/2 VUs, 59 complete and 0 interrupted iterations
default   [  53% ] 2 VUs  1m04.0s/2m0s

running (1m05.0s), 2/2 VUs, 60 complete and 0 interrupted iterations
default   [  54% ] 2 VUs  1m05.0s/2m0s

running (1m06.0s), 2/2 VUs, 61 complete and 0 interrupted iterations
default   [  55% ] 2 VUs  1m06.0s/2m0s

running (1m07.0s), 2/2 VUs, 62 complete and 0 interrupted iterations
default   [  56% ] 2 VUs  1m07.0s/2m0s

running (1m08.0s), 2/2 VUs, 63 complete and 0 interrupted iterations
default   [  57% ] 2 VUs  1m08.0s/2m0s

running (1m09.0s), 2/2 VUs, 64 complete and 0 interrupted iterations
default   [  57% ] 2 VUs  1m09.0s/2m0s

running (1m10.0s), 2/2 VUs, 65 complete and 0 interrupted iterations
default   [  58% ] 2 VUs  1m10.0s/2m0s

running (1m11.0s), 2/2 VUs, 66 complete and 0 interrupted iterations
default   [  59% ] 2 VUs  1m11.0s/2m0s

running (1m12.0s), 2/2 VUs, 67 complete and 0 interrupted iterations
default   [  60% ] 2 VUs  1m12.0s/2m0s

running (1m13.0s), 2/2 VUs, 68 complete and 0 interrupted iterations
default   [  61% ] 2 VUs  1m13.0s/2m0s

running (1m14.0s), 2/2 VUs, 69 complete and 0 interrupted iterations
default   [  62% ] 2 VUs  1m14.0s/2m0s

running (1m15.0s), 2/2 VUs, 70 complete and 0 interrupted iterations
default   [  62% ] 2 VUs  1m15.0s/2m0s

running (1m16.0s), 2/2 VUs, 71 complete and 0 interrupted iterations
default   [  63% ] 2 VUs  1m16.0s/2m0s

running (1m17.0s), 2/2 VUs, 72 complete and 0 interrupted iterations
default   [  64% ] 2 VUs  1m17.0s/2m0s

running (1m18.0s), 2/2 VUs, 73 complete and 0 interrupted iterations
default   [  65% ] 2 VUs  1m18.0s/2m0s

running (1m19.0s), 2/2 VUs, 74 complete and 0 interrupted iterations
default   [  66% ] 2 VUs  1m19.0s/2m0s

running (1m20.0s), 2/2 VUs, 75 complete and 0 interrupted iterations
default   [  67% ] 2 VUs  1m20.0s/2m0s

running (1m21.0s), 2/2 VUs, 76 complete and 0 interrupted iterations
default   [  67% ] 2 VUs  1m21.0s/2m0s

running (1m22.0s), 2/2 VUs, 77 complete and 0 interrupted iterations
default   [  68% ] 2 VUs  1m22.0s/2m0s

running (1m23.0s), 2/2 VUs, 78 complete and 0 interrupted iterations
default   [  69% ] 2 VUs  1m23.0s/2m0s

running (1m24.0s), 2/2 VUs, 79 complete and 0 interrupted iterations
default   [  70% ] 2 VUs  1m24.0s/2m0s

running (1m25.0s), 2/2 VUs, 80 complete and 0 interrupted iterations
default   [  71% ] 2 VUs  1m25.0s/2m0s

running (1m26.0s), 2/2 VUs, 81 complete and 0 interrupted iterations
default   [  72% ] 2 VUs  1m26.0s/2m0s

running (1m27.0s), 2/2 VUs, 82 complete and 0 interrupted iterations
default   [  72% ] 2 VUs  1m27.0s/2m0s

running (1m28.0s), 2/2 VUs, 83 complete and 0 interrupted iterations
default   [  73% ] 2 VUs  1m28.0s/2m0s

running (1m29.0s), 2/2 VUs, 84 complete and 0 interrupted iterations
default   [  74% ] 2 VUs  1m29.0s/2m0s

running (1m30.0s), 2/2 VUs, 85 complete and 0 interrupted iterations
default   [  75% ] 2 VUs  1m30.0s/2m0s

running (1m31.0s), 2/2 VUs, 86 complete and 0 interrupted iterations
default   [  76% ] 2 VUs  1m31.0s/2m0s

running (1m32.0s), 2/2 VUs, 87 complete and 0 interrupted iterations
default   [  77% ] 2 VUs  1m32.0s/2m0s

running (1m33.0s), 2/2 VUs, 88 complete and 0 interrupted iterations
default   [  77% ] 2 VUs  1m33.0s/2m0s

running (1m34.0s), 2/2 VUs, 89 complete and 0 interrupted iterations
default   [  78% ] 2 VUs  1m34.0s/2m0s

running (1m35.0s), 2/2 VUs, 90 complete and 0 interrupted iterations
default   [  79% ] 2 VUs  1m35.0s/2m0s

running (1m36.0s), 2/2 VUs, 91 complete and 0 interrupted iterations
default   [  80% ] 2 VUs  1m36.0s/2m0s

running (1m37.0s), 2/2 VUs, 92 complete and 0 interrupted iterations
default   [  81% ] 2 VUs  1m37.0s/2m0s

running (1m38.0s), 2/2 VUs, 93 complete and 0 interrupted iterations
default   [  82% ] 2 VUs  1m38.0s/2m0s

running (1m39.0s), 2/2 VUs, 94 complete and 0 interrupted iterations
default   [  82% ] 2 VUs  1m39.0s/2m0s

running (1m40.0s), 2/2 VUs, 95 complete and 0 interrupted iterations
default   [  83% ] 2 VUs  1m40.0s/2m0s

running (1m41.0s), 2/2 VUs, 96 complete and 0 interrupted iterations
default   [  84% ] 2 VUs  1m41.0s/2m0s

running (1m42.0s), 2/2 VUs, 97 complete and 0 interrupted iterations
default   [  85% ] 2 VUs  1m42.0s/2m0s

running (1m43.0s), 2/2 VUs, 98 complete and 0 interrupted iterations
default   [  86% ] 2 VUs  1m43.0s/2m0s

running (1m44.0s), 2/2 VUs, 99 complete and 0 interrupted iterations
default   [  87% ] 2 VUs  1m44.0s/2m0s

running (1m45.0s), 2/2 VUs, 100 complete and 0 interrupted iterations
default   [  87% ] 2 VUs  1m45.0s/2m0s

running (1m46.0s), 2/2 VUs, 101 complete and 0 interrupted iterations
default   [  88% ] 2 VUs  1m46.0s/2m0s

running (1m47.0s), 2/2 VUs, 102 complete and 0 interrupted iterations
default   [  89% ] 2 VUs  1m47.0s/2m0s

running (1m48.0s), 2/2 VUs, 103 complete and 0 interrupted iterations
default   [  90% ] 2 VUs  1m48.0s/2m0s

running (1m49.0s), 2/2 VUs, 104 complete and 0 interrupted iterations
default   [  91% ] 2 VUs  1m49.0s/2m0s

running (1m50.0s), 2/2 VUs, 105 complete and 0 interrupted iterations
default   [  92% ] 2 VUs  1m50.0s/2m0s

running (1m51.0s), 2/2 VUs, 106 complete and 0 interrupted iterations
default   [  92% ] 2 VUs  1m51.0s/2m0s

running (1m52.0s), 2/2 VUs, 107 complete and 0 interrupted iterations
default   [  93% ] 2 VUs  1m52.0s/2m0s

running (1m53.0s), 2/2 VUs, 108 complete and 0 interrupted iterations
default   [  94% ] 2 VUs  1m53.0s/2m0s

running (1m54.0s), 2/2 VUs, 109 complete and 0 interrupted iterations
default   [  95% ] 2 VUs  1m54.0s/2m0s

running (1m55.0s), 2/2 VUs, 110 complete and 0 interrupted iterations
default   [  96% ] 2 VUs  1m55.0s/2m0s

running (1m56.0s), 2/2 VUs, 111 complete and 0 interrupted iterations
default   [  97% ] 2 VUs  1m56.0s/2m0s

running (1m57.0s), 2/2 VUs, 112 complete and 0 interrupted iterations
default   [  97% ] 2 VUs  1m57.0s/2m0s

running (1m58.0s), 2/2 VUs, 113 complete and 0 interrupted iterations
default   [  98% ] 2 VUs  1m58.0s/2m0s

running (1m59.0s), 2/2 VUs, 114 complete and 0 interrupted iterations
default   [  99% ] 2 VUs  1m59.0s/2m0s

running (2m00.0s), 2/2 VUs, 115 complete and 0 interrupted iterations
default   [ 100% ] 2 VUs  2m00.0s/2m0s

running (2m01.0s), 1/2 VUs, 116 complete and 0 interrupted iterations
default ↓ [ 100% ] 2 VUs  2m0s
time="2023-02-01T12:45:18Z" level=warning msg="Request Failed" error="Post \"undefined/exports/undefined\": unsupported protocol scheme \"\""
time="2023-02-01T12:45:18Z" level=info msg=0 source=console

running (2m01.3s), 0/2 VUs, 117 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  2m0s

     ✗ is status 200
      ↳  95% — ✓ 224 / ✗ 10

     █ setup

     █ teardown

     checks.........................: 95.72% ✓ 224      ✗ 10 
     data_received..................: 238 MB 2.0 MB/s
     data_sent......................: 22 kB  183 B/s
     http_req_blocked...............: avg=34.79ms min=0s       med=4.4µs   max=7.14s    p(90)=8.97µs  p(95)=268.09µs
     http_req_connecting............: avg=34.78ms min=0s       med=0s      max=7.14s    p(90)=0s      p(95)=201.92µs
     http_req_duration..............: avg=11.6ms  min=0s       med=10.11ms max=112.27ms p(90)=15.43ms p(95)=16.91ms 
       { expected_response:true }...: avg=12.17ms min=7.22ms   med=10.2ms  max=112.27ms p(90)=15.74ms p(95)=16.93ms 
     http_req_failed................: 4.68%  ✓ 11       ✗ 224
     http_req_receiving.............: avg=4.59ms  min=0s       med=4.05ms  max=72.73ms  p(90)=6.49ms  p(95)=8.47ms  
     http_req_sending...............: avg=27.76µs min=0s       med=19.09µs max=152.59µs p(90)=50.91µs p(95)=70.29µs 
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=6.98ms  min=0s       med=5.74ms  max=107.02ms p(90)=9.87ms  p(95)=11.41ms 
     http_reqs......................: 235    1.936936/s
     iteration_duration.............: avg=2.02s   min=128.89µs med=2s      max=7.18s    p(90)=2s      p(95)=2.02s   
     iterations.....................: 117    0.964347/s
     vus............................: 1      min=1      max=2
     vus_max........................: 2      min=2      max=2